# ch03_43: 日次リターンがプラスである日付のみを抽出

daily_stock_return[daily_stock_return$firm1 > 0, ]$date # 企業1のみで条件付け
# 2次元目の要素を空白とすると，全ての列が選択される
# daily_stock_return$date[daily_stock_return$firm1 > 0]と書いても同じ

## [1] "2020-04-02" "2020-04-03" "2020-04-06" "2020-04-09" "2020-04-10" "2020-04-13" "2020-04-15" "2020-04-17" "2020-04-20" "2020-04-22" "2020-04-27" "2020-04-30"

daily_stock_return[daily_stock_return$firm1 > 0 & daily_stock_return$firm2 > 0, ]$date # 企業1と2の両方で条件付け

## [1] "2020-04-06" "2020-04-09" "2020-04-10" "2020-04-13" "2020-04-15" "2020-04-17" "2020-04-20"